gemi254/ConfigAssist-ESP32-ESP8266/src/configAssist.cpp
// Get seperation location of given key
int ConfigAssist::getSepKeyPos(String thisKey) {
  if (_seperators.empty()) return -1;
  auto lower = std::lower_bound(_seperators.begin(), _seperators.end(), thisKey, [](
      const confSeperators &a, const String &b) { 
      //Serial.printf("Comp conf sep: %s %s \n", a.name.c_str(), b.c_str());    
      return a.name < b;}
  );
  int keyPos = std::distance(_seperators.begin(), lower); 
  if (thisKey == _seperators[keyPos].name) return keyPos;
  //LOG_INF("Sep key %s not found\n", thisKey.c_str()); 
  return -1; // not found
}

// Extract a config tokens from keyValPair and load it into configs vector
void ConfigAssist::loadVectItem(String keyValPair) {  
  if (keyValPair.length()) {
    std::string token[2];
    int i = 0;
    std::istringstream pair(keyValPair.c_str());
    while (std::getline(pair, token[i++], INI_FILE_DELIM));
    if (i != 3) 
      if (i == 2) { //Empty param
        String key(token[0].c_str()); 
        add(key, "");
      }else{
        LOG_ERR("Unable to parse '%s', len %u, items: %i\n", keyValPair.c_str(), keyValPair.length(), i);
      }
    else {
      String key(token[0].c_str()); 
      String val(token[1].c_str());
      val.replace("\r","");
      val.replace("\n","");
      #if DONT_ALLOW_SPACES
      val.replace(" ","");
      #endif                    
      //No label used for memory issues
      add(key, val);
    }
  }
  if (_configs.size() > MAX_PARAMS) 
    LOG_WRN("Config file entries: %u exceed max: %u\n", _configs.size(), MAX_PARAMS);
}
    
// Build json on Wifi scan complete     
void ConfigAssist::scanComplete(int networksFound) {
  LOG_INF("%d network(s) found\n", networksFound);      
  if( networksFound <= 0 ) return;
  
  _jWifi = "[";
  for (int i = 0; i < networksFound; ++i){
      if(i) _jWifi += ",\n";
      _jWifi += "{";
      _jWifi += "\"rssi\":"+String(WiFi.RSSI(i));
      _jWifi += ",\"ssid\":\""+WiFi.SSID(i)+"\"";
      _jWifi += "}";
      LOG_DBG("%i,%s\n", WiFi.RSSI(i), WiFi.SSID(i).c_str());
    }
  _jWifi += "]";
  LOG_DBG("Scan complete \n");    
}

// Send wifi scan results to client
void ConfigAssist::checkScanRes(){
  int n = WiFi.scanComplete();
  if(n>0){
    scanComplete(n);
    WiFi.scanDelete();
    startScanWifi();
  }        
}

// Start async wifi scan
void ConfigAssist::startScanWifi(){
  int n = WiFi.scanComplete();
  if(n==-1){
    LOG_DBG("Scan in progress..\n");
  }else if(n==-2){
    LOG_DBG("Starting async scan..\n");          
    WiFi.scanNetworks(/*async*/true,/*show_hidden*/true);
  }else{
    LOG_DBG("Scan complete status: %i\n", n);
  }
}  

// LogPrint function
#define MAX_FMT 128
static char fmtBuf[MAX_FMT];
static char outBuf[256];
static va_list arglist;
bool ca_logToFile = LOG_TO_FILE;
char ca_logLevel = LOG_LEVEL;
File ca_logFile;

//Logging with level to serial or file
void logPrint(const char *level, const char *format, ...){
  if(level[0] > ca_logLevel) return;
  strncpy(fmtBuf, format, MAX_FMT);
  fmtBuf[MAX_FMT - 1] = 0;
  va_start(arglist, format); 
  vsnprintf(outBuf, MAX_FMT, fmtBuf, arglist);
  va_end(arglist);
  //size_t msgLen = strlen(outBuf);
  Serial.print(outBuf);
  
  if (ca_logToFile){
    if(!ca_logFile) ca_logFile = STORAGE.open(LOG_FILENAME, "a+");
    if(!ca_logFile){
      Serial.printf("Failed to open log file: %s\n", LOG_FILENAME);
      ca_logToFile = false;
    }else{
      //Serial.printf("Opened log %s\n", LOG_FILENAME);
    }

    ca_logFile.print(outBuf);
    ca_logFile.flush();
  }
}
